app/Controllers/UserCrud.php

    public function index()
    {
        $userModel = new CrudModel();
        $data['user_table'] = $userModel->orderBy('id','DESC')->findAll();
---
SELECT *
FROM `user_table`
ORDER BY `id` DESC